const _Regular = {
  int: /^(\-|\+)?([0-9]+|Infinity)$/,
  positiveInt: /^[1-9]\d*|0$/,
  positiveIntOrDecimal: /^([1-9]\d*|0)(\.\d*)?$/,
  idCard: /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}$)/,
  chinese: /^[\\u4e00-\\u9fa5]{0,}$/,
  email: /[\\w!#$%&'*+/=?^_`{|}~-]+(?:\\.[\\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\\w](?:[\\w-]*[\\w])?\\.)+[\\w](?:[\\w-]*[\\w])?/,
  money: /^[0-9]+(.[0-9]{2})?$/,
  phone: /^[1]([3-9])[0-9]{9}$/,
  ip4: /\\b(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\b/,
  ip6: /(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))/,
  img: /\\< *[img][^\\\\>]*[src] *= *[\\"\\']{0,1}([^\\"\\'\\ >]*)/,
  url: /^(((ht|f)tps?):\/\/)?[\w-]+(\.[\w-]+)+([\w.,@?^=%&:/~+#-]*[\w@?^=%&/~+#-])?$/,
  creditCode: /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/,
  financialCode: /^(?=.*[A-Z])(?=.*\d)[A-Z\d]{15}$/,
};

export type RegularType = keyof typeof _Regular;

/**
 * 所有正则表达式
 * @param int - 整数
 * @param positiveInt - 正整数
 * @param positiveIntOrDecimal - 正整数 or 小数
 * @param idCard - 身份证号
 * @param chinese - 中文
 * @param email - 邮箱
 * @param money - 金额（精确到2位小数）
 * @param phone - 电话
 * @param ip4 - ip4
 * @param ip6 - ip6
 * @param img - img元素
 * @param url - url
 * @param creditCode - 统一社会信用代码
 * @param financialCode - 金融机构代码
 */
export const Regular = new Proxy(_Regular, {
  get(target, key: RegularType) {
    return target[key];
  },
  set() {
    throw new Error("Regular can not be modified！");
  },
});
